books_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "memo", "created_at", "updated_at", "author", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["title", "rwgq"], ["memo", "regv"], ["created_at", "2019-11-17 01:21:46.153783"], ["updated_at", "2019-11-17 01:21:46.153783"], ["author", "reqg"], ["picture", "33166863_p0.jpg"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "memo" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "oihjknr"], ["memo", "areknva"], ["updated_at", "2019-11-08 01:36:48.524598"], ["id", 2]]